package com.dayker.ex12;

/*
Напишите программу, в которой используются две переменные логического типа (boolean),
присвойте им значения и выведете для каждой переменной на экран строку "истина",
 если переменная имеет значение true и "ложь", если переменная имеет значение false.
 */

public class Main {
    public static void main(String[] args) {
        boolean first = true, second = false;
        if (first) System.out.println("first is true");
        else System.out.println("first is false");
        if (second) System.out.println("second is true.");
        else System.out.println("second is false");
    }
}
